<template>
  <div class="wrap">
    <div class="content">
      <h3 class="text-center pt-3 mb-5">聯絡我們</h3>
      <div class="contact-us-cont">
        <div class="contact-us-cont-connection">
          <div class="contact-us-cont-connection-chat">
            <div class="contact-us-cont-connection-header">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                version="1.1"
                id="Capa_1"
                x="0px"
                y="0px"
                viewBox="0 0 511.999 511.999"
                style="enable-background: new 0 0 511.999 511.999"
                xml:space="preserve"
                class="contact-us-icon"
              >
                <g>
                  <g>
                    <path
                      d="M467,75.993h-45v-15c0-24.813-20.187-45-45-45H45c-24.813,0-45,20.187-45,45v240c0,24.813,20.187,45,45,45h45v75    c0,13.384,16.222,19.992,25.606,10.606l25.607-25.606h169.574l85.606,85.606c9.389,9.393,25.606,2.8,25.606-10.606v-75h45    c24.813,0,45-20.187,45-45v-240C512,96.18,491.813,75.993,467,75.993z M120,384.78v-53.787c0-8.284-6.716-15-15-15H45    c-8.271,0-15-6.729-15-15v-240c0-8.271,6.729-15,15-15h332c8.271,0,15,6.729,15,15v240c0,8.271-6.729,15-15,15H195    c-3.979,0-7.793,1.581-10.606,4.394L120,384.78z M482,360.993c0,8.271-6.729,15-15,15h-60c-8.284,0-15,6.716-15,15v53.787    l-64.394-64.393c-2.813-2.813-6.628-4.394-10.606-4.394H171.213l30-30H377c24.813,0,45-20.187,45-45v-195h45    c8.271,0,15,6.729,15,15V360.993z"
                    />
                  </g>
                </g>
                <g>
                  <g>
                    <path
                      d="M287,105.993H75c-8.284,0-15,6.716-15,15s6.716,15,15,15h212c8.284,0,15-6.716,15-15S295.284,105.993,287,105.993z"
                    />
                  </g>
                </g>
                <g>
                  <g>
                    <path
                      d="M347,165.993H75c-8.284,0-15,6.716-15,15s6.716,15,15,15h272c8.284,0,15-6.716,15-15S355.284,165.993,347,165.993z"
                    />
                  </g>
                </g>
                <g>
                  <g>
                    <path
                      d="M227,225.993H75c-8.284,0-15,6.716-15,15s6.716,15,15,15h152c8.284,0,15-6.716,15-15S235.284,225.993,227,225.993z"
                    />
                  </g>
                </g>
              </svg>
            </div>
            <div class="contact-us-cont-connection-txt">
              <h5>線上聯繫</h5>
              <p>早上9點 - 下午6點 六日不營業</p>
              <button class="main-btn">立即聯繫</button>
            </div>
          </div>
          <div class="contact-us-cont-connection-phone">
            <div class="contact-us-cont-connection-header">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 512 512"
                class="contact-us-icon"
              >
                <path
                  d="m123.832031 475.464844c39.558594 23.804687 84.789063 36.351562 131.261719 36.351562 140.824219 0 256.90625-114.914062 256.90625-255.910156 0-140.832031-115.917969-255.90625-256.90625-255.90625-140.558594 0-254.910156 114.800781-254.910156 255.90625 0 47.09375 12.550781 92.667969 36.351562 132.257812l-36.535156 123.835938zm-93.65625-219.558594c0-124.570312 100.898438-225.917969 224.917969-225.917969 125.121094 0 226.917969 101.347657 226.917969 225.917969 0 124.574219-101.796875 225.917969-226.917969 225.917969-43.054688 0-84.894531-12.195313-120.984375-35.273438l-5.765625-3.683593-83.988281 24.78125 24.777343-83.992188-3.683593-5.761719c-23.078125-36.097656-35.273438-78.277343-35.273438-121.988281zm0 0"
                />
                <path
                  d="m124.628906 208.753906c4.953125 26.011719 19.65625 76.042969 62.464844 118.851563 42.808594 42.808593 92.839844 57.515625 118.855469 62.46875 29.789062 5.671875 73.503906 6.527343 94.867187-14.835938l11.910156-11.910156c6.011719-6.011719 9.324219-14.007813 9.324219-22.511719s-3.3125-16.496094-9.324219-22.507812l-47.628906-47.628906c-6.015625-6.015626-14.007812-9.324219-22.511718-9.324219-8.503907 0-16.496094 3.308593-22.511719 9.324219l-11.90625 11.90625c-7.273438 7.273437-21.003907 7.304687-28.332031.089843l-47.507813-49.5c-.070313-.074219-.140625-.148437-.214844-.21875-7.285156-7.285156-7.285156-19.140625 0-26.425781l11.90625-11.90625c12.445313-12.445312 12.445313-32.582031 0-45.023438l-47.628906-47.628906c-12.410156-12.410156-32.605469-12.410156-45.019531 0l-11.90625 11.910156v-.003906c-17.050782 17.054688-22.734375 53.40625-14.835938 94.875zm36.042969-73.664062c12.5-12.214844 11.832031-12.449219 13.210937-12.449219.472657 0 .945313.179687 1.304688.539063 50.1875 50.457031 48.171875 47.492187 48.171875 48.9375 0 .503906-.183594.945312-.539063 1.304687l-11.910156 11.90625c-18.964844 18.964844-19.039062 49.664063-.121094 68.714844l47.535157 49.53125c.074219.070312.144531.144531.21875.21875 18.960937 18.960937 51.808593 19.023437 70.832031 0l11.90625-11.90625c.71875-.71875 1.890625-.71875 2.609375 0 50.1875 50.453125 48.171875 47.488281 48.171875 48.933593 0 .507813-.183594.945313-.539062 1.304688l-11.910157 11.90625c-8.160156 8.160156-34.152343 13.042969-68.054687 6.585938-22.625-4.3125-66.128906-17.085938-103.257813-54.214844-37.128906-37.128906-49.902343-80.632813-54.210937-103.257813-6.460938-33.902343-1.578125-59.898437 6.582031-68.054687zm0 0"
                />
              </svg>
            </div>
            <div class="contact-us-cont-connection-txt">
              <h5>線上客服</h5>
              <p>
                9:00 ~ 12:00 online， 12:00 ~ 13:30 休息 ， 13:30 ~ 18:00 online
              </p>
              <p>(02)-1234-5678</p>
            </div>
          </div>
          <div class="contact-us-cont-connection-email">
            <div class="contact-us-cont-connection-header">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink"
                version="1.1"
                id="Capa_1"
                x="0px"
                y="0px"
                viewBox="0 0 512 512"
                style="enable-background: new 0 0 512 512"
                xml:space="preserve"
                class="contact-us-icon"
              >
                <g>
                  <g>
                    <path
                      d="M467,61H45C20.218,61,0,81.196,0,106v300c0,24.72,20.128,45,45,45h422c24.72,0,45-20.128,45-45V106    C512,81.28,491.872,61,467,61z M460.786,91L256.954,294.833L51.359,91H460.786z M30,399.788V112.069l144.479,143.24L30,399.788z     M51.213,421l144.57-144.57l50.657,50.222c5.864,5.814,15.327,5.795,21.167-0.046L317,277.213L460.787,421H51.213z M482,399.787    L338.213,256L482,112.212V399.787z"
                    />
                  </g>
                </g>
              </svg>
            </div>
            <div class="contact-us-cont-connection-txt">
              <h5>客服信箱</h5>
              <p>abcdefg@gmail.com</p>
              <p>
                信件會在24小時內收到，並回傳一封閱讀信件訊息，客服人員會在48小時內盡速與您聯絡。
              </p>
            </div>
          </div>
        </div>
        <div class="contact-us-cont-info">
          <p>
            本地商品購買後，若有產品疑慮與問題，請撥打客服電話聯絡，若想要現場測試或是換貨等服務，可以請洽雷蛇官網尋找服務地址，前往現場服務。
          </p>
          <p>請多加善用線上客服與線上聊天室。</p>
        </div>
      </div>
    </div>
    <div class="contact-us-question">
      <div class="contact-us-question-item">
        <h3>有問題?</h3>
        <p>來問問其他使用者吧~</p>
        <button class="main-btn">前往</button>
      </div>
      <div class="contact-us-question-item">
        <h3>搜尋問題支援</h3>
        <div>
          <button>
            <svg
              xmlns="http://www.w3.org/2000/svg"
              xmlns:xlink="http://www.w3.org/1999/xlink"
              version="1.1"
              id="Layer_1"
              x="0px"
              y="0px"
              viewBox="0 0 512 512"
              style="enable-background: new 0 0 512 512"
              xml:space="preserve"
              class="contact-search-btn"
            >
              <g>
                <g>
                  <path
                    d="M508.875,493.792L353.089,338.005c32.358-35.927,52.245-83.296,52.245-135.339C405.333,90.917,314.417,0,202.667,0    S0,90.917,0,202.667s90.917,202.667,202.667,202.667c52.043,0,99.411-19.887,135.339-52.245l155.786,155.786    c2.083,2.083,4.813,3.125,7.542,3.125c2.729,0,5.458-1.042,7.542-3.125C513.042,504.708,513.042,497.958,508.875,493.792z     M202.667,384c-99.979,0-181.333-81.344-181.333-181.333S102.688,21.333,202.667,21.333S384,102.677,384,202.667    S302.646,384,202.667,384z"
                  />
                </g>
              </g>
            </svg>
          </button>
          <input type="text" placeholder="請輸入你要尋找的問題" />
        </div>
      </div>
    </div>
  </div>
</template>
<style lang="scss">
@import '@/assets/all.scss';
.contact-us-icon {
  width: 64px;
  height: 64px;
  fill: map-get($color, three);
  transition: all 0.5s;
  // &:hover {
  //   fill: map-get($color, main);
  // }
}
.contact-us-cont {
  max-width: 1200px;
  width: 90%;
  margin: auto;
  &-connection {
    display: flex;
    justify-content: center;
    @media (max-width: 576px) {
      flex-direction: column;
      align-items: center;
    }
    & > div {
      max-width: 33%;
      flex-basis: 33%;
      text-align: center;
      cursor: pointer;
      @media (max-width: 576px) {
        max-width: 90%;
        flex-basis: 90%;
        margin-bottom: 30px;
      }
      &:hover {
        .contact-us-icon {
          fill: map-get($color, main);
        }
      }
    }
    &-txt {
      & > h5 {
        margin: 10px;
      }
      & > p {
        margin: 10px;
      }
    }
  }
  &-info {
    max-width: 50%;
    flex-basis: 50%;
    margin-top: 30px;
    @media (max-width: 576px) {
      margin: auto;
      margin-top: 30px;
    }
  }
}
.contact-us-question {
  display: flex;
  justify-content: center;
  background-color: map-get($color, bgcolor);
  margin-top: 30px;
  @media (max-width: 576px) {
    flex-wrap: wrap;
  }
  &-item {
    max-width: 30%;
    flex-basis: 30%;
    padding: 30px;
    text-align: center;
    @media (max-width: 900px) {
      max-width: 45%;
      flex-basis: 45%;
    }
    @media (max-width: 576px) {
      max-width: 80%;
      flex-basis: 80%;
    }
    & > p {
      margin: 10px;
    }
    & > div {
      margin: 10px;
      position: relative;
      & > input {
        width: 100%;
      }
      & > button {
        position: absolute;
        right: 5px;
        top: 8px;
      }
    }
  }
}
.contact-search-btn {
  width: 16px;
  height: 16px;
}
</style>
